In [10]:
import pandas as pd
import seaborn as sns

In [3]:
df1=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],"veri":[10,15,47,85,47,20]}, columns=["gruplar","veri"])
df1

  gruplar  veri
0       A    10
1       B    15
2       C    47
3       A    85
4       B    47
5       C    20

In [8]:
df1.groupby("gruplar") #grupları yakalıdık burda

In [9]:
df1.groupby("gruplar").sum() #gruplara istedigimiz işlemi yaptık

         veri
gruplar
A          95
B          62
C          67

In [7]:
df1.groupby("gruplar").describe().T

gruplar             A          B          C
veri count   2.000000   2.000000   2.000000
     mean   47.500000  31.000000  33.500000
     std    53.033009  22.627417  19.091883
     min    10.000000  15.000000  20.000000
     25%    28.750000  23.000000  26.750000
     50%    47.500000  31.000000  33.500000
     75%    66.250000  39.000000  40.250000
     max    85.000000  47.000000  47.000000

In [12]:
df2=sns.load_dataset("planets")
df2.head(10)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008
6  Radial Velocity       1        1773.400   4.64     18.15  2002
7  Radial Velocity       1         798.500    NaN     21.41  1996
8  Radial Velocity       1         993.300  10.30     73.10  2008
9  Radial Velocity       2         452.800   1.99     74.79  2010

In [13]:
df2.groupby("method")

In [14]:
df2.groupby("method")["orbital_period"]

In [15]:
df2.groupby("method")["orbital_period"].sum()

method
Astrometry                       1.262360e+03
Eclipse Timing Variations        4.276480e+04
Imaging                          1.418973e+06
Microlensing                     2.207500e+04
Orbital Brightness Modulation    2.127920e+00
Pulsar Timing                    3.671511e+04
Pulsation Timing Variations      1.170000e+03
Radial Velocity                  4.553151e+05
Transit                          8.377523e+03
Transit Timing Variations        2.393505e+02
Name: orbital_period, dtype: float64

In [17]:
df2.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64